src/Documents/ИТ_УстановкаПланаПродаж_РозничныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_УстановкаПланаПродаж_РозничныйКлассификатор</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИТ_ПланПродаж_РозничныйКлассификатор</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РозничныйКлассификатор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИерархияАльтернативная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыручкаРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВаловаяМаржаРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписаниеРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИТ_УстановкаПланаПродаж_РозничныйКлассификатор/Forms/ИмпортИзExcel/Ext/Form/Module.bsl
#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройка табличного документа
	ДанныеИмпорта.Область(1, 1).Текст = "Розничный классификатор";
	ДанныеИмпорта.Область(1, 1).ШиринаКолонки = 60;
	ДанныеИмпорта.Область(1, 1).Шрифт = Новый Шрифт(,, Истина);
	
	ДанныеИмпорта.Область(1, 2).Текст = "Выручка, ₽";
	ДанныеИмпорта.Область(1, 2).ШиринаКолонки = 15;
	ДанныеИмпорта.Область(1, 2).Шрифт = Новый Шрифт(,, Истина);
	
	ДанныеИмпорта.Область(1, 3).Текст = "Валовая маржа, ₽";
	ДанныеИмпорта.Область(1, 3).ШиринаКолонки = 15;
	ДанныеИмпорта.Область(1, 3).Шрифт = Новый Шрифт(,, Истина);
	
	ДанныеИмпорта.Область(1, 4).Текст = "Списание, ₽";
	ДанныеИмпорта.Область(1, 4).ШиринаКолонки = 15;
	ДанныеИмпорта.Область(1, 4).Шрифт = Новый Шрифт(,, Истина);
	
	ДанныеИмпорта.Область(1, 5).Текст = "Статус";
	ДанныеИмпорта.Область(1, 5).ШиринаКолонки = 60;
	ДанныеИмпорта.Область(1, 5).Шрифт = Новый Шрифт(,, Истина);
	
	// Заполнение данных документа
	Для Каждого СтрокаПланаПродаж Из Параметры.ПланПродаж Цикл 
		СтрокаДанныхДокумента = ДанныеДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанныхДокумента, СтрокаПланаПродаж);
		ОпределитьУровеньКлассификатора(СтрокаДанныхДокумента);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДокументаРозничныйКлассификаторПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеДокумента.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		ОпределитьУровеньКлассификатора(ТекущиеДанные);	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ОбработатьДанные(Команда)
	
	ОбработатьДанныеСервер();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИмпорт(Команда)
	
	Если ДанныеКорректны() Тогда 
		Закрыть(ДанныеДокумента);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьДанныеСервер()
	
	Для НомерСтроки = 2 По ДанныеИмпорта.ВысотаТаблицы Цикл 
		ЗначениеПоиска = СокрЛП(ДанныеИмпорта.Область(НомерСтроки, 1).Текст);
		РозничныйКлассификатор = НайтиРозничныйКлассификатор(ЗначениеПоиска, НомерСтроки);
		
		Если РозничныйКлассификатор = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
				
		СтрокиДанныхДокумента = ДанныеДокумента.НайтиСтроки(Новый Структура("РозничныйКлассификатор", РозничныйКлассификатор)); 
		
		Если СтрокиДанныхДокумента.Количество() = 0 Тогда 
			СтрокаДанныхДокумента = ДанныеДокумента.Добавить();
			СтрокаДанныхДокумента.РозничныйКлассификатор = РозничныйКлассификатор;
		Иначе
			СтрокаДанныхДокумента = СтрокиДанныхДокумента.Получить(0);	
		КонецЕсли;
		
		ОпределитьУровеньКлассификатора(СтрокаДанныхДокумента);
		СтрокаДанныхДокумента.ВыручкаРуб = ПолчитьЧисло("Выручка, ₽", НомерСтроки, 2);
		СтрокаДанныхДокумента.ВаловаяМаржаРуб = ПолчитьЧисло("Валовая маржа, ₽", НомерСтроки, 3);
		СтрокаДанныхДокумента.СписаниеРуб = ПолчитьЧисло("Списание, ₽", НомерСтроки, 4);
		
		ДополнитьСтатус(НомерСтроки, "Успешно", Ложь); 
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Функция НайтиРозничныйКлассификатор(ЗначениеПоиска, НомерСтроки)

	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИТ_РозничныйКлассификатор.Ссылка КАК РозничныйКлассификатор
		|ИЗ
		|	Справочник.ИТ_РозничныйКлассификатор КАК ИТ_РозничныйКлассификатор
		|ГДЕ
		|	ИТ_РозничныйКлассификатор.ЕРПМастерКлюч = &ЗначениеПоиска
		|	И НЕ ИТ_РозничныйКлассификатор.ПометкаУдаления
		|	И НЕ ИТ_РозничныйКлассификатор.ЭтоГруппа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИТ_РозничныйКлассификатор.Ссылка
		|ИЗ
		|	Справочник.ИТ_РозничныйКлассификатор КАК ИТ_РозничныйКлассификатор
		|ГДЕ
		|	ИТ_РозничныйКлассификатор.Наименование = &ЗначениеПоиска
		|	И НЕ ИТ_РозничныйКлассификатор.ПометкаУдаления
		|	И НЕ ИТ_РозничныйКлассификатор.ЭтоГруппа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИТ_РозничныйКлассификатор.Ссылка
		|ИЗ
		|	Справочник.ИТ_РозничныйКлассификатор КАК ИТ_РозничныйКлассификатор
		|ГДЕ
		|	ИТ_РозничныйКлассификатор.Наименование ПОДОБНО &ЗначениеПоиска
		|	И НЕ ИТ_РозничныйКлассификатор.ПометкаУдаления
		|	И НЕ ИТ_РозничныйКлассификатор.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ЗначениеПоиска", СокрЛП(ЗначениеПоиска));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		РозничныйКлассификатор = Выборка.РозничныйКлассификатор;
	Иначе
		РозничныйКлассификатор = Неопределено;
		ДополнитьСтатус(НомерСтроки, "Розничный классификатор не найден");
	КонецЕсли;	
	
	// Возврат
	Возврат РозничныйКлассификатор;
	
КонецФункции	

&НаСервере
Процедура ОпределитьУровеньКлассификатора(СтрокаДанных)
	
	СтрокаДанных.Уровень = СтрокаДанных.РозничныйКлассификатор.Уровень();
	
КонецПроцедуры	

&НаСервере
Функция ПолчитьЧисло(ИмяПоля, НомерСтроки, НомерСтолбца)
	
	СтрокаЧисла = СокрЛП(ДанныеИмпорта.Область(НомерСтроки, НомерСтолбца).Текст);
	СтрокаЧисла = СтрЗаменить(СтрокаЧисла, " ", "");
	СтрокаЧисла = СтрЗаменить(СтрокаЧисла, Символы.НПП, "");
	
	Если ПустаяСтрока(СтрокаЧисла) Тогда 
		СтрокаЧисла = "0";
	КонецЕсли;	
	
	Попытка 
		Возврат Число(СтрокаЧисла);
	Исключение
		ДополнитьСтатус(НомерСтроки, СтрШаблон("Не удалось определить число поля %1", ИмяПоля));		
		Возврат 0;	
	КонецПопытки;
	
КонецФункции	

&НаСервере
Процедура ДополнитьСтатус(НомерСтроки, Текст, ЭтоОшибка = Истина)
	
	КрайнийСтолбец = 5;
	ОбластьСтатуса = ДанныеИмпорта.Область(НомерСтроки, КрайнийСтолбец);
	ТекстСтатуса = СокрЛП(ОбластьСтатуса.Текст); 
	
	Если ПустаяСтрока(ТекстСтатуса) Тогда 
		ОбластьСтатуса.Текст = Текст;
	Иначе
		Если ЭтоОшибка Тогда 
			ОбластьСтатуса.Текст = ОбластьСтатуса.Текст + "; " + Текст;
		КонецЕсли;
		
		ЭтоОшибка = Истина;	
	КонецЕсли;	
	
	Если ЭтоОшибка Тогда 
		ДанныеИмпорта.Область(НомерСтроки, 1, НомерСтроки, КрайнийСтолбец).ЦветФона = Новый Цвет(255, 230, 230);
	Иначе
		ДанныеИмпорта.Область(НомерСтроки, 1, НомерСтроки, КрайнийСтолбец).ЦветФона = Новый Цвет(230, 255, 230);			
	КонецЕсли;	
		
КонецПроцедуры	

&НаСервере
Функция ДанныеКорректны()
	
	ДанныеКорректны = Истина;
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДокумента.РозничныйКлассификатор,
		|	ДанныеДокумента.Уровень,
		|	1 КАК Количество
		|ПОМЕСТИТЬ ДанныеДокумента
		|ИЗ
		|	&ДанныеДокумента КАК ДанныеДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.РозничныйКлассификатор,
		|	СУММА(ДанныеДокумента.Количество) КАК Количество
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДокумента.РозничныйКлассификатор
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДанныеДокумента.Количество) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.РозничныйКлассификатор,
		|	ДанныеДокумента.Уровень
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Уровень <> 2";
	
	Запрос.УстановитьПараметр("ДанныеДокумента", ДанныеДокумента.Выгрузить());
			
	Результат = Запрос.ВыполнитьПакет();
	МассивСообщений = Новый Массив();
	
	// Дубли
	Выборка = Результат.Получить(1).Выбрать();
	Если Выборка.Количество() > 0 Тогда 
		МассивСообщений.Добавить("Удалите дубли розничного классификатора:");
		
		Пока Выборка.Следующий() Цикл 
			МассивСообщений.Добавить(СтрШаблон("	%1", Выборка.РозничныйКлассификатор));
		КонецЦикла;
		
		МассивСообщений.Добавить(Символы.ПС + Символы.ПС);
	КонецЕсли;	
	
	// Уровень отличен от 3
	Выборка = Результат.Получить(2).Выбрать();
	Если Выборка.Количество() > 0 Тогда 
		МассивСообщений.Добавить("Скорректируйте розничные классификаторы (уровень должен быть 3):");
		
		Пока Выборка.Следующий() Цикл 
			МассивСообщений.Добавить(СтрШаблон("	%1", Выборка.РозничныйКлассификатор));
		КонецЦикла;
	КонецЕсли;	
	
	ВывестиМассивСообщений(МассивСообщений, ДанныеКорректны);
	
	// Возврат 
	Возврат ДанныеКорректны;
	
КонецФункции	

&НаСервере
Процедура ВывестиМассивСообщений(МассивСообщений, ДанныеКорректны)
	
	Если МассивСообщений.Количество() > 0 Тогда 
		ДанныеКорректны = Ложь;	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(МассивСообщений, Символы.ПС));
		МассивСообщений.Очистить();
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти
